Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 64, 19200, 1)]    0         
_________________________________________________________________
conv2d (Conv2D)              (None, 64, 19200, 8)      256       
_________________________________________________________________
batch_normalization (BatchNo (None, 64, 19200, 8)      32        
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 1, 19200, 16)      1024      
_________________________________________________________________
batch_normalization_1 (Batch (None, 1, 19200, 16)      64        
_________________________________________________________________
activation (Activation)      (None, 1, 19200, 16)      0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 1, 4800, 16)       0         
_________________________________________________________________
dropout (Dropout)            (None, 1, 4800, 16)       0         
_________________________________________________________________
separable_conv2d (SeparableC (None, 1, 4800, 16)       512       
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 4800, 16)       64        
_________________________________________________________________
activation_1 (Activation)    (None, 1, 4800, 16)       0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 1, 600, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 600, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 9600)              0         
_________________________________________________________________
dense (Dense)                (None, 3)                 28803     
_________________________________________________________________
softmax (Activation)         (None, 3)                 0         
=================================================================
Total params: 30,755
Trainable params: 30,675
Non-trainable params: 80
_________________________________________________________________
None
(12864, 64, 1)
Epoch 1/5
